src/InformationRegisters/ХранилищеАрхивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеАрхивов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПутьКАрхиву</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АрхивЗагруженВХранилище</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДвоичныеДанныеФайлаАрхива</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипАрхива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФайловАрхива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ХранилищеАрхивов/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
//
//
Процедура СократитьАрхив(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();	
	Диалог.Период = Новый СтандартныйПериод;
	Если Диалог.Редактировать() Тогда 
    	СократитьАрхивНаСервере(Диалог.Период);
		ЭтаФорма.ОбновитьОтображениеДанных();		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
//
//
Процедура СократитьАрхивНаСервере(ВыбранныйПериод)
	
	ДатаНачала = ВыбранныйПериод.ДатаНачала;
	ДатаОкончания = ?(ЗначениеЗаполнено(ВыбранныйПериод.ДатаОкончания), ВыбранныйПериод.ДатаОкончания, ДобавитьМесяц(ТекущаяДатаСеанса(), 100));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранилищеАрхивов.ДатаСобытия,
		|	ХранилищеАрхивов.ИнформационнаяБаза
		|ИЗ
		|	РегистрСведений.ХранилищеАрхивов КАК ХранилищеАрхивов
		|ГДЕ
		|	НЕ(ХранилищеАрхивов.ДатаСобытия МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|
		|ДЛЯ ИЗМЕНЕНИЯ";

	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	
	НаборЗаписей = РегистрыСведений.ХранилищеАрхивов.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	НаборЗаписей.Записать();
		
КонецПроцедуры
